

text = {
    'swamp':
        {
            'predatory':
                {
                    1:
                        'Китайский аллигатор',
                    2:
                        'Тупорылый крокодил',
                    3:
                        'Чёрный кайман',
                    4:
                        'Гладколобый кайман',
                    5:
                        'Сиамский крокодил',
                    6:
                        'Нильский крокодил',
                },
            'herbivores':
                {
                    1:
                        'Веслоног денниси',
                    2:
                        'Дальневосточная квакша',
                    3:
                        'Трёхпалая амфиума',
                    4:
                        'Сверчковая жаба',
                    5:
                        'Красноглазая квакша',
                    6:
                        'Монгольская жаба',
                    7:
                        'Зелёная жаба',
                    8:
                        'Жаба ага',
                    9:
                        'Африканский водонос',
                    10:
                        'Огненная саламандра',
                },
        },
    'ocean':
        {
            'nord':
                {
                    'herbivores':
                        {
                            1:
                                'Пингвин гумбольдта',
                            2:
                                'Папуанский пингвин',
                            3:
                                'Пингвин очковый',
                            4:
                                'Морж',

                        },
                    'predatory':
                        {
                            1:
                                'Северный морской котик',
                            2:
                                'Серый тюлень',
                            3:
                                'Ларга',
                            4:
                                'Сивуч',
                            5:
                                'Морской заяц',
                            6:
                                'Белый медведь'
                        },
                },
            'south':
                {
                    'turtle':
                        {
                            1:
                                'Слоновая черепаха',
                            2:
                                'Лучистая черепаха',
                            3:
                                'Каймановая черепаха'
                        },
                    'flamingo':
                        {
                            1:
                                'Розовый фламинго',
                            2:
                                'Красный фламинго'
                        },
                    'stork':
                        {
                            1:
                                'Африканскиё марабу',
                            2:
                                'Большая выпь',
                            3:
                                'Египетская цапля',
                            4:
                                'Седлоклювый ябиру',
                            5:
                                'Белый аист',
                            6:
                                'Алый ибис',
                            7:
                                'Чёрный аист'
                        },

                },
        },
    'wood_jungles':
        {
            'predatory':
                {
                    'cats':
                        {
                            1:
                                'Восточно-сибирская рысь',
                            2:
                                'Дальневосточный леопард',
                            3:
                                'Амурский тигр',
                        },
                    'scaly':
                        {
                            1:
                                'Тёмный-тигровый питон',
                            2:
                                'Сетчатый питон',
                            3:
                                'Парагвайская анаконда',
                            4:
                                'Обыкновенный удав'
                        },
                    'dogs':
                        {
                            1:
                                'Южноевропейский шакал',
                            2:
                                'Енотовидная собака',
                            3:
                                'Кустарниковая собака',
                            4:
                                'Обыкновенная лисица',
                            5:
                                'Песец',
                            6:
                                'Европейский волк',
                            7:
                                'Уссурийский-белогрудый медведь',
                        },
                    'raccoon':
                        {
                            1:
                                'Лесная куница',
                            2:
                                'Носуха',
                            3:
                                'Сурикат',
                            4:
                                'Уссурийская харза',
                            5:
                                'Енот полоскун',
                            6:
                                'Медоед',
                        },
                    'owl':
                        {
                            1:
                                'Филлин',
                            2:
                                'Ушастая сова',
                            3:
                                'Обыкновенная сипуха',
                            4:
                                'Обыкновенная неясыть',
                            5:
                                'Мохноногий сыч',
                            6:
                                'Длиннохвостая неясыть',
                            7:
                                'Бородатая неясыть',
                            8:
                                'Болотная сова',
                            9:
                                'Белая сова'
                        },
                },
            'herbivores':
                {
                    'rodents':
                        {
                            1:
                                'Иглистая мышь',
                            2:
                                'Мышь-малютка',
                            3:
                                'Северная-тонкохвостая крыса',
                            4:
                                'Белогрудый ёж',
                            5:
                                'Ушастый ёж',
                            6:
                                'Капская землянная белка',
                            7:
                                'Обыкновенный бобр'
                        },
                    'primates':
                        {
                            1:
                                'Краснорукий тамарин',
                            2:
                                'Боливийская мирикина',
                            3:
                                'Золотыстый-львиный тамарин',
                            4:
                                'Лемур кошачий'
                        },
                    'sparrow':
                        {
                            1:
                                'Голубая сорока',
                            2:
                                'Сорока',
                            3:
                                'Турухтан',
                            4:
                                'Ходулочник',
                            5:
                                'Кулик сорока',
                            6:
                                'Сойка',
                            7:
                                'Большая шпорцевая кукушка',
                            8:
                                'Балийский скворец'
                        },
                    'parrot':
                        {
                            1:
                                'Сливоголовый попугай',
                            2:
                                'Орлинный попугай',
                            3:
                                'Синелобый амазон',
                            4:
                                'Александрийский попугай',
                            5:
                                'Малый-кольчатый попугай',
                            6:
                                'Венесуэльский амазон',
                            7:
                                'Желтолобый амазон',
                            8:
                                'Малый желтохохлый какаду',
                            9:
                                'Малый солдатский ара',
                            10:
                                'Молуккский какаду',
                            11:
                                'Краснохвостый жако',
                            12:
                                'Благородный зелёно-красный попугай',
                            13:
                                'Розовый какаду',
                            14:
                                'Большой желтохохлый какаду',
                            15:
                                'Какаду гоффина',
                        },
                    'artiodactyls':
                        {
                            1:
                                'Большой олененёк',
                            2:
                                'Обыкновенный дикдик',
                        },
                },
        },
    'plain_dune':
        {
            'predatory':
                {
                    'cats':
                        {
                            1:
                                'Манул',
                            2:
                                'Камышовый кот',
                            3:
                                'Степной кот',
                            4:
                                'Восточно-сибирская рысь',
                            5:
                                'Индийский лев',
                        },
                    'falcon':
                        {
                            1:
                                'Бородач',
                            2:
                                'Белоголовый сип',
                            3:
                                'Обыкновенный канюк',
                            4:
                                'Секретарь',
                            5:
                                'Малый подорлик',
                            6:
                                'Беркут'
                        },
                    'dogs':
                        {
                            1:
                                'Южно-европейский шакал',
                            2:
                                'Красный волк',
                            3:
                                'Фенек',
                            4:
                                'Кустарниковая собака',
                            5:
                                'Полосатая гиена',
                            6:
                                'Медоед',
                        },
                },
            'herbivores':
                {
                    'incomplete_teeth':
                        {
                            1:
                                'Капский трубкозуб',
                            2:
                                'Щетинистый броненосец',
                            3:
                                'Гигантский муравьед',
                            4:
                                'Четырёхпалый муравьед'
                        },
                    'birds':
                        {
                            'cancerous':
                                {

                                    1:
                                        'Кафский-рогатый ворон',
                                    2:
                                        'Китоглав',
                                    3:
                                        'Папуанский калао',
                                    4:
                                        'Большой тукан'
                                },
                            'chicken':
                                {
                                    1:
                                        'Обыкновенный фазан',
                                    2:
                                        'Шлемоносный казуар',
                                    3:
                                        'Хохлатый гокко',
                                    4:
                                        'Фазан аргус',
                                    5:
                                        'Обыкновенный павлин'
                                },
                            'crane':
                                {
                                    1:
                                        'Коростель',
                                    2:
                                        'Черношейный журавль',
                                    3:
                                        'Сероспинный трубач',
                                    4:
                                        'Лысуха',
                                    5:
                                        'Журавль красавка',
                                    6:
                                        'Журавль стэнли',
                                    7:
                                        'Восточный-венценосный журавль',
                                    8:
                                        'Японский журавль',
                                },

                            'goose':
                                {
                                    1:
                                        'Белолобый гусь',
                                    2:
                                        'Белощёкая казарка',
                                    3:
                                        'Нильский гусь',
                                    4:
                                        'Горный гусь',
                                    5:
                                        'Гавайская казарка',
                                    6:
                                        'Гуменник',
                                    7:
                                        'Малый-белый гусь',
                                    8:
                                        'Сухонос',
                                    9:
                                        'Красноголовый-магеланов гусь',
                                    10:
                                        'Серый гусь',
                                    11:
                                        'Серая утка',
                                    12:
                                        'Канадская казарка',
                                    13:
                                        'Гоголь',
                                    14:
                                        'Каролинка',
                                    15:
                                        'Пеганка',
                                    16:
                                        'Лебедь шипун',
                                    17:
                                        'Магеланов гусь',
                                    18:
                                        'Чилийская свиязь',
                                    19:
                                        'Свиясь',
                                    20:
                                        'Черношейный лебедь'
                                },
                            'pigeon':
                                {
                                    1:
                                        'Черногребенчатый голубь',
                                    2:
                                        'Двуцветный-плодоядный голубь',
                                    3:
                                        'Никобарский голубь',
                                    4:
                                        'Веероносный-венценосный голубь'
                                },
                            'turaco':
                                {
                                    1:
                                        'Гвинейский турако',
                                    2:
                                        'Фиолетовый турако',
                                },
                        },
                    'rodents':
                        {
                            1:
                                'Дегу',
                            2:
                                'Даман брюса',
                            3:
                                'Африканская соня',
                            4:
                                'Капибара',
                            5:
                                'Степной сурок',
                        },
                    'marsupials':
                        {
                            1:
                                'Щетинохвостый кенгуру',
                            2:
                                'Кенгуру беннета'
                        },
                    'ungulates':
                        {
                            1:
                                'Осел',
                            2:
                                'Зебра греви',
                            3:
                                'Лошадь домашняя'
                        },
                    'artiodactyls':
                        {
                            1:
                                'Канадский овцебык',
                            2:
                                'Голубой баран',
                            3:
                                'Сычуаньский такин',
                            4:
                                'Южноафриканская-чёрная антилопа',
                            5:
                                'Карликовый бегемот',
                            6:
                                'Двухгорбый верблюд',
                            7:
                                'Альпака',
                            8:
                                'Азиатский слон',
                        }
                }
        },
    'mount':
        {
            'predatory':
                {
                    'cats':
                        {
                            1:
                                'Манул',
                            2:
                                'Камышовый кот',
                            3:
                                'Степной кот',
                            4:
                                'Восточно-сибирская рысь',
                            5:
                                'Пума',
                        },
                    'falcon':
                        {
                            1:
                                'Бородач',
                            2:
                                'Белоголовый сип',
                            3:
                                'Обыкновенный канюк',
                            4:
                                'Секретарь',
                            5:
                                'Малый подорлик',
                            6:
                                'Беркут'
                        },
                    'dogs':
                        {
                            1:
                                'Фенек',
                            2:
                                'Кустарниковая собака',
                            3:
                                'Медоед',
                            4:
                                'Европейский волк',
                        },
                },
            'herbivores':
                {
                    1:
                        'Голубой баран',
                    2:
                        'Дагестанский тур',
                    3:
                        'Сычуаньский такин',
                    4:
                        'Таджикский-винторогий козёл',
                    5:
                        'Альпака',
                },
        },
    'bats':
        {
            1:
                'Очковый листонос',
            2:
                'Двухцветный кожан',
            3:
                'Нильский крылан'
        },
}


