

text = {
    'swamp':
        {
            'predatory':
                {
                    1:
                        'китайский аллигатор',
                    2:
                        'тупорылый крокодил',
                    3:
                        'чёрный кайман',
                    4:
                        'гладколобый кайман',
                    5:
                        'сиамский крокодил',
                    6:
                        'нильский крокодил',
                },
            'herbivores':
                {
                    1:
                        'веслоног денниси',
                    2:
                        'дальневосточная квакша',
                    3:
                        'трёхпалая амфиума',
                    4:
                        'сверчковая жаба',
                    5:
                        'красноглазая квакша',
                    6:
                        'монгольская жаба',
                    7:
                        'зелёная жаба',
                    8:
                        'жаба ага',
                    9:
                        'африканский водонос',
                    10:
                        'огненная саламандра',
                },
        },
    'ocean':
        {
            'nord':
                {
                    'herbivores':
                        {
                            1:
                                'пингвин гумбольдта',
                            2:
                                'папуанский пингвин',
                            3:
                                'пингвин очковый',
                            4:
                                'морж a',

                        },
                    'predatory':
                        {
                            1:
                                'северный-морской котик',
                            2:
                                'серый тюлень',
                            3:
                                'ларга a',
                            4:
                                'сивуч a',
                            5:
                                'морской заяц',
                            6:
                                'белый медведь'
                        },
                },
            'south':
                {
                    'turtle':
                        {
                            1:
                                'слоновая черепаха',
                            2:
                                'лучистая черепаха',
                            3:
                                'каймановая черепаха'
                        },
                    'flamingo':
                        {
                            1:
                                'розовый фламинго',
                            2:
                                'красный фламинго'
                        },
                    'stork':
                        {
                            1:
                                'африканскиё марабу',
                            2:
                                'большая выпь',
                            3:
                                'египетская цапля',
                            4:
                                'седлоклювый ябиру',
                            5:
                                'белый аист',
                            6:
                                'алый ибис',
                            7:
                                'чёрный аист'
                        },

                },
        },
    'wood_jungles':
        {
            'predatory':
                {
                    'cats':
                        {
                            1:
                                'восточно-сибирская рысь',
                            2:
                                'дальневосточный леопард',
                            3:
                                'амурский тигр',
                        },
                    'scaly':
                        {
                            1:
                                'тёмный-тигровый питон',
                            2:
                                'сетчатый питон',
                            3:
                                'парагвайская анаконда',
                            4:
                                'обыкновенный удав'
                        },
                    'dogs':
                        {
                            1:
                                'южноевропейский шакал',
                            2:
                                'енотовидная собака',
                            3:
                                'кустарниковая собака',
                            4:
                                'обыкновенная лисица',
                            5:
                                'песец a',
                            6:
                                'европейский волк',
                            7:
                                'уссурийский-белогрудый медведь',
                        },
                    'raccoon':
                        {
                            1:
                                'лесная куница',
                            2:
                                'носуха a',
                            3:
                                'сурикат a',
                            4:
                                'уссурийская харза',
                            5:
                                'енот полоскун',
                            6:
                                'медоед a',
                        },
                    'owl':
                        {
                            1:
                                'филлин a',
                            2:
                                'ушастая сова',
                            3:
                                'обыкновенная сипуха',
                            4:
                                'обыкновенная неясыть',
                            5:
                                'мохноногий сыч',
                            6:
                                'длиннохвостая неясыть',
                            7:
                                'бородатая неясыть',
                            8:
                                'болотная сова',
                            9:
                                'белая сова'
                        },
                },
            'herbivores':
                {
                    'rodents':
                        {
                            1:
                                'иглистая мышь',
                            2:
                                'мышь-малютка',
                            3:
                                'северная-тонкохвостая крыса',
                            5:
                                'белогрудый ёж',
                            6:
                                'ушастый ёж',
                            7:
                                'капская-землянная белка',
                            8:
                                'обыкновенный бобр'
                        },
                    'primates':
                        {
                            1:
                                'краснорукий тамарин',
                            2:
                                'боливийская мирикина',
                            3:
                                'золотыстый-львиный тамарин',
                            4:
                                'лемур кошачий'
                        },
                    'sparrow':
                        {
                            1:
                                'голубая сорока',
                            2:
                                'сорока a',
                            3:
                                'турухтан a',
                            4:
                                'ходулочник a',
                            5:
                                'кулик сорока',
                            6:
                                'сойка a',
                            7:
                                'большая-шпорцевая кукушка',
                            8:
                                'балийский скворец'
                        },
                    'parrot':
                        {
                            1:
                                'сливоголовый попугай',
                            2:
                                'орлинный попугай',
                            3:
                                'синелобый амазон',
                            4:
                                'александрийский попугай',
                            5:
                                'малый-кольчатый попугай',
                            6:
                                'венесуэльский амазон',
                            7:
                                'желтолобый амазон',
                            8:
                                'малый-желтохохлый какаду',
                            9:
                                'малый-солдатский ара',
                            10:
                                'молуккский какаду',
                            11:
                                'краснохвостый жако',
                            12:
                                'благородный-зелёно-красный попугай',
                            13:
                                'розовый какаду',
                            14:
                                'большой-желтохохлый какаду',
                            15:
                                'какаду гоффина',
                        },
                    'artiodactyls':
                        {
                            1:
                                'большой олененёк',
                            2:
                                'обыкновенный дикдик',
                        },
                },
        },
    'plain_dune':
        {
            'predatory':
                {
                    'cats':
                        {
                            1:
                                'манул |',
                            2:
                                'камышовый кот',
                            3:
                                'степной кот',
                            4:
                                'восточно-сибирская рысь',
                            5:
                                'индийский лев',
                        },
                    'falcon':
                        {
                            1:
                                'бородач a',
                            2:
                                'белоголовый сип',
                            3:
                                'обыкновенный канюк',
                            4:
                                'секретарь a',
                            5:
                                'малый подорлик',
                            6:
                                'беркут a'
                        },
                    'dogs':
                        {
                            1:
                                'южноевропейский шакал',
                            2:
                                'красный волк',
                            3:
                                'фенек a',
                            4:
                                'кустарниковая собака',
                            5:
                                'полосатая гиена',
                            6:
                                'медоед a',
                        },
                },
            'herbivores':
                {
                    'incomplete_teeth':
                        {
                            1:
                                'капский трубкозуб',
                            2:
                                'щетинистый броненосец',
                            3:
                                'гигантский муравьед',
                            4:
                                'четырёхпалый муравьед'
                        },
                    'birds':
                        {
                            'cancerous':
                                {

                                    1:
                                        'кафский-рогатый ворон',
                                    2:
                                        'китоглав a',
                                    3:
                                        'папуанский калао',
                                    4:
                                        'большой тукан'
                                },
                            'chicken':
                                {
                                    1:
                                        'обыкновенный фазан',
                                    2:
                                        'шлемоносный казуар',
                                    3:
                                        'хохлатый гокко',
                                    4:
                                        'фазан аргус',
                                    5:
                                        'обыкновенный павлин'
                                },
                            'crane':
                                {
                                    1:
                                        'коростель a',
                                    2:
                                        'черношейный журавль',
                                    3:
                                        'сероспинный трубач',
                                    4:
                                        'лысуха a',
                                    5:
                                        'журавль красавка',
                                    6:
                                        'журавль стэнли',
                                    7:
                                        'восточный-венценосный журавль',
                                    8:
                                        'японский журавль',
                                },

                            'goose':
                                {
                                    1:
                                        'белолобый гусь',
                                    2:
                                        'белощёкая казарка',
                                    3:
                                        'нильский гусь',
                                    4:
                                        'горный гусь',
                                    5:
                                        'гавайская казарка',
                                    6:
                                        'гуменник a',
                                    7:
                                        'малый-белый гусь',
                                    8:
                                        'сухонос a',
                                    9:
                                        'красноголовый-магеланов гусь',
                                    10:
                                        'серый гусь',
                                    11:
                                        'серая утка',
                                    12:
                                        'канадская казарка',
                                    13:
                                        'гоголь a',
                                    14:
                                        'каролинка a',
                                    15:
                                        'пеганка a',
                                    16:
                                        'лебедь шипун',
                                    17:
                                        'магеланов гусь',
                                    18:
                                        'чилийская свиязь',
                                    19:
                                        'свиясь a',
                                    20:
                                        'черношейный лебедь'
                                },
                            'pigeon':
                                {
                                    1:
                                        'черногребенчатый голубь',
                                    2:
                                        'двуцветный-плодоядный голубь',
                                    3:
                                        'никобарский голубь',
                                    4:
                                        'веероносный-венценосный голубь'
                                },
                            'turaco':
                                {
                                    1:
                                        'гвинейский турако',
                                    2:
                                        'фиолетовый турако',
                                },
                        },
                    'rodents':
                        {
                            1:
                                'дегу a',
                            2:
                                'даман брюса',
                            3:
                                'африканская соня',
                            4:
                                'капибара a',
                            5:
                                'степной сурок',
                        },
                    'marsupials':
                        {
                            1:
                                'щетинохвостый кенгуру',
                            2:
                                'кунгуру беннета'
                        },
                    'ungulates':
                        {
                            1:
                                'осел a',
                            2:
                                'зебра греви',
                            3:
                                'лошадь домашняя'
                        },
                    'artiodactyls':
                        {
                            1:
                                'канадский овцебык',
                            2:
                                'голубой баран',
                            3:
                                'сычуаньский такин',
                            4:
                                'южноафриканская-чёрная антилопа',
                            5:
                                'карликовый бегемот',
                            6:
                                'двухгорбый верблюд',
                            7:
                                'альпака a',
                            8:
                                'азиатский слон',
                        }
                }
        },
    'mount':
        {
            'predatory':
                {
                    'cats':
                        {
                            1:
                                'манул a',
                            2:
                                'камышовый кот',
                            3:
                                'степной кот',
                            4:
                                'восточно-сибирская рысь',
                            5:
                                'пума  a',
                        },
                    'falcon':
                        {
                            1:
                                'бородач a',
                            2:
                                'белоголовый сип',
                            3:
                                'обыкновенный канюк',
                            4:
                                'секретарь a',
                            5:
                                'малый подорлик',
                            6:
                                'беркут a'
                        },
                    'dogs':
                        {
                            1:
                                'фенек a',
                            2:
                                'кустарниковая собака',
                            3:
                                'медоед a',
                            4:
                                'европейский волк',
                        },
                },
            'herbivores':
                {
                    1:
                        'голубой баран',
                    2:
                        'дагестанский тур',
                    3:
                        'сычуаньский такин',
                    4:
                        'таджикский-винторогий козёл',
                    5:
                        'альпака a ',
                },
        },
    'bats':
        {
            1:
                'очковый листонос',
            2:
                'двухцветный кожан',
            3:
                'нильский крылан'
        },
}


